const TermsAndConditions = (): JSX.Element => {
  return (
    <div className="row">
      <div className="col-lg-12 col-xl-10 col-xxl-8 mx-auto mt-n20">
        <div className="card">
          <div className="card-body p-7 p-lg-11">
            <p>
              Интернет сайт с адрес academy.magnalabs.com и magnalabs.com са собственост на Магналабс
              ЕООД, с ЕИК 203340782 и адрес на управление гр. София, ул. Лерин 21 (наричано по-долу
              Администратор), в съответствие с разпоредбите на Закона за защита на личните данни, Регламент
              2016/679 на Съвета и ЕП и свързаната правна уредба.
              <br/>
              <br/>
              Настоящата Политика за поверителност има за цел да Ви информира за начина, по който се
              обработват Вашите лични данни, както и за Вашите права. Магналабс ЕООД запазва правото си да
              променя Политиката за поверителност.
              <br/>
              <br/>
              Магналабс ЕООД не обработва лични данни на лица под 18 години, без съгласието на техните
              родители или законни представители. В случай, че сте лице на възраст под 18 години, моля да
              не ползвате този сайт.
              <br/>
              <br/>
              Магналабс ЕООД се стреми да Ви предостави достъпна и полезна информация на сайта.
              Чрез обработката на Вашите лични данни и при спазване на тяхната поверителност, ние
              подготвяме съдържание, което би могло да съответства на Вашите потребителски
              предпочитания. Магналабс ЕООД използва личните Ви данни единствено за
              целите, за които са събрани – да се свърже с Вас и да отговори на конкретните Ви запитвания,
              да ви предоставя актуална информация, както и да идентифицира всеки един фармацевт и
              помощник-фармацевт, за да може да получи точките си за акредитация от Българската Асоциация на
              помощник-фармацевтите (БАПФ).
              <br/>
              <br/>
              Сигурността на сайта се постига чрез технически и организационни мерки срещу загуба,
              унищожаване, проникване, изменение или разпространение на Вашите данни от
              неоторизирани лица.
              <br/>
              <br/>
              Лични данни, които обработваме
              <br/>
              <br/>
              Събираме от Вас лична информация само когато ни я предоставите доброволно – при
              доброволна регистрация в платформата. Личната информация може да включва данните Ви за
              контакт, като например име, телефонен номер, адрес на електронна поща, УИН номер,
              месторабота и др.
              <br/>
              <br/>
              Начините за събиране на лична информация, които Администратора използва са както
              следва:
              - Форма за регистрация
              Администраторът използва данните Ви само за целите, за които се събират. При обработката
              на Вашите въпросници и информацията от тях и свързаните лични данни могат да бъдат
              предоставени на БАПФ и Български фармацевтичен съюз (БФС) единствено с цел зачисляване на
              получените точки за акредитация.
              Предоставените от Вас данни се използват за следните цели:
              – за идентификация на Вашите въпросници
              - За получване на точки за акредитация от Ваша страна.
              На интернет сайта на Администратора се публикуват съобщения за игри, промоции, анкети и
              кампании, в които имате право да участвате, както и препратки към такива активности
              (например във Facebook). Администраторът използва предоставената от Вас информация
              само в случаите, които сте се съгласили да участвате в тези активности, за да осъществим
              контакт с Вас.
              <br/>
              <br/>
              След постигане на целта, за която сме събрали Вашите лични данни, ние
              се задължаваме незабавно да ги унищожим, освен в случаите, в които е налице друг
              определен от закона срок за тяхното съхранение.
              Вашите права
              В случай, че сте предоставили Ваши лични данни на Администратора чрез този сайт, Вие
              разполагате със следните възможности по всяко време:
              – право на достъп до личните Ви данни, обработвани от Администратора;
              – право да искате извършването на подходящо коригиране, заличаване или блокиране на
              личните Ви данни и правото да възразявате по всяко време срещу обработването на личните
              Ви данни, когато има законни основания за това;
              – право да откажете обработване на личните Ви данни за целите на получаване на актуални
              новини и информационни услуги и други маркетингови комуникации и др.;
              – право на жалба до Комисия за защита на личните данни, ако считате че са нарушени
              Вашите права за защита на данните.
              В случай, че желаете да упражните правото си на достъп, коригиране или отказ от получаване
              на инфо бюлетин и други маркетингови комуникации, може да се свържете с нас чрез
              изпращане на електронно съобщение на office@mgnlabs.com.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default TermsAndConditions;